In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [2]:
walkability_df = pd.read_csv("PDX_Neighborhood_Walkability.csv",sep=",")

In [3]:
walkability_df

    Rank                Name  Walk Score  Transit Score  Bike Score Population
0      1               Pearl          97             89          98      5,989
1      2  Old Town Chinatown          97             95          97      3,873
2      3            Downtown          96             94          90     12,803
3      4           Hollywood          94             70          94      1,274
4      5        Goose Hollow          93             84          80      5,825
..   ...                 ...         ...            ...         ...        ...
84    85    Sylvan-Highlands          18             44          35      1,290
85    86       East Columbia          16             32          51      1,858
86    87   Northwest Heights          12              7          28      5,495
87    88          Sunderland          10             33          48        703
88    89             Linnton           5             21          21        935

[89 rows x 6 columns]

In [4]:
walk_x = walkability_df["Name"]
walk_y = walkability_df["Walk Score"]

In [5]:
walkscore_df = walkability_df[["Name","Walk Score"]]
walkscore_df

                  Name  Walk Score
0                Pearl          97
1   Old Town Chinatown          97
2             Downtown          96
3            Hollywood          94
4         Goose Hollow          93
..                 ...         ...
84    Sylvan-Highlands          18
85       East Columbia          16
86   Northwest Heights          12
87          Sunderland          10
88             Linnton           5

[89 rows x 2 columns]

In [ ]:
plt.xticks(rotation=90)
# plt.xscale(100)
plt.bar(walkx,y)

In [ ]:
plt.xticks(rotation=45)